tap "homebrew/bundle"
tap "charmbracelet/tap"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "steveyegge/beads"
tap "withgraphite/tap"

# shell, prompt, core utils
brew "fish"
brew "starship"
brew "fzf"
brew "ripgrep"
brew "jq"
brew "xq"
brew "miller"
brew "htop"
brew "tldr"
brew "tmux"
brew "watch"
brew "wget"
brew "mosh"
brew "telnet"
brew "mtr"
brew "prettyping"
brew "direnv"

# git / jj
brew "git"
brew "git-delta"
brew "gitu"
brew "gh"
brew "jj"
brew "jjui"
brew "mergiraf"
brew "difftastic"

# editors / multiplexer
brew "neovim"
brew "helix"
brew "zellij"

# languages, runtimes, LSPs
brew "go"
brew "gopls"
brew "golangci-lint"
brew "node"
brew "pnpm"
brew "bun"
brew "uv"
brew "poetry"
brew "rust-analyzer"
brew "zls"

# cloud / infra
brew "awscli"
brew "azure-cli"
brew "terraform"
brew "tfenv"
brew "kubernetes-cli"
brew "kubie"
brew "helm"
brew "cloudflared"

# formats / media / docs
brew "pandoc"
brew "ffmpeg"
brew "marp-cli"
brew "httpie", link: false

# databases
brew "mysql-client"
brew "redis"

# ai clis
brew "aider"
brew "claude_code"
brew "gemini-cli"

# apis / oauth / work
brew "oauth2l"
brew "jira-cli"

# tapped
brew "charmbracelet/tap/crush"
brew "steveyegge/beads"
brew "withgraphite/tap/gt"
brew "hashicorp/tap/packer"

# fonts
cask "font-meslo-lg-nerd-font"
cask "font-ubuntu-mono-nerd-font"

# password / secrets
cask "1password"
cask "1password-cli"

# terminals / editors / IDEs
cask "iterm2"
cask "ghostty"
cask "visual-studio-code"
cask "cursor"
cask "zed"
cask "sublime-text"
cask "sublime-merge"

# ai apps
cask "claude"
cask "codex"

# browsers
cask "arc"
cask "google-chrome"
cask "firefox"

# productivity
cask "alfred"
cask "raycast"
cask "obsidian"
cask "notion"
cask "notion-calendar"
cask "linear-linear"
cask "granola"
cask "dash"

# comms
cask "slack"
cask "webex"
cask "signal"

# dev / ops tooling
cask "orbstack"
cask "docker-desktop"
cask "tailscale-app"
cask "gcloud-cli"
cask "meld"

# window manager
cask "nikitabobko/tap/aerospace"
