tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "aider"
brew "awscli"
brew "cloudflared"
brew "difftastic"
brew "direnv"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "gitu"
brew "go"
brew "gopls"
brew "htop"
brew "httpie", link: false
brew "jira-cli"
brew "jj"
brew "jq"
brew "kubernetes-cli"
brew "marp-cli"
brew "miller"
brew "mtr"
brew "neovim"
brew "node"
brew "pandoc"
brew "pnpm"
brew "poetry"
brew "prettyping"
brew "ripgrep"
brew "rust-analyzer"
brew "starship"
brew "telnet"
brew "terraform"
brew "watch"
brew "xq"
brew "zls"
cask "1password"
cask "1password-cli"
cask "font-meslo-lg-nerd-font"
cask "alfred"
cask "arc"
cask "claude"
cask "cursor"
cask "httpie-desktop"
cask "iterm2"
cask "mactex"
cask "obsidian"
cask "orbstack"
cask "setapp"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "tailscale-app"
cask "visual-studio-code"
cask "webex"
cask "zed"
