tap "homebrew/bundle"
brew "aider"
brew "awscli"
brew "claude_code"
brew "cloudflared"
brew "difftastic"
brew "direnv"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "gitu"
brew "go"
brew "httpie", link: false
brew "jira-cli"
brew "jj"
brew "kubernetes-cli"
brew "marp-cli"
brew "miller"
brew "mtr"
brew "neovim"
brew "pandoc"
brew "pnpm"
brew "poetry"
brew "prettyping"
brew "ripgrep"
brew "starship"
brew "telnet"
brew "terraform"
brew "watch"
brew "xq"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "arc"
cask "claude"
cask "cursor"
cask "httpie-desktop"
cask "iterm2"
cask "mactex"
cask "obsidian"
cask "orbstack"
cask "setapp"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "tailscale-app"
cask "visual-studio-code"
cask "webex"
cask "zed"
vscode "4ops.terraform"
vscode "a-h.templ"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alefragnani.project-manager"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "arjun.swagger-viewer"
vscode "bbenoist.nix"
vscode "bbenoist.vagrant"
vscode "benfradet.vscode-unison"
vscode "bmarkovic.haproxy"
vscode "bmewburn.vscode-intelephense-client"
vscode "bodil.file-browser"
vscode "bradlc.vscode-tailwindcss"
vscode "brettm12345.nixfmt-vscode"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "elmtooling.elm-ls-vscode"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "hbenl.vscode-test-explorer"
vscode "iliazeus.vscode-ansi"
vscode "jacobdufault.fuzzy-search"
vscode "jakebecker.elixir-ls"
vscode "julialang.language-julia"
vscode "justusadam.language-haskell"
vscode "kahole.magit"
vscode "kokororin.vscode-phpfmt"
vscode "lucax88x.codeacejumper"
vscode "mechatroner.rainbow-csv"
vscode "mksafi.find-jump"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "octref.vetur"
vscode "pollywoggames.pico8-ls"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "rubymaniac.vscode-direnv"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "sysoev.vscode-open-in-github"
vscode "tamasfe.even-better-toml"
vscode "tootone.org-mode"
vscode "unison-lang.unison"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vasa81.vscode-dumb-jump"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "waderyan.gitblame"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "wolframresearch.wolfram"
vscode "zamerick.vscode-caddyfile-syntax"
vscode "zhuangtongfa.material-theme"
vscode "ziglang.vscode-zig"
